InformationRegisters/СведенияОФизлицахУчастникахВОВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОФизлицахУчастникахВОВ</Name>
			<Comment>(Регл)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииФизлицУчастниковВОВ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СерияУдостоверения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерУдостоверения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/КатегорииФизлицУчастниковВОВ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>КатегорииФизлицУчастниковВОВ</Name>
			<Comment>(Регл)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УчастникВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицоПриравненноеКУчастникамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицоПриравненноеКИнвалидамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетераныБоевыхДействийНаТерриторииДругихГосударств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВетераныТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяКатегорияЛицПриравненныхКУчастникамВОВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвалидВОВ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/СведенияОФизлицахУчастникахВОВ/Ext/RecordSetModule.bsl
// Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для Каждого СтрокаСведенийВОВ Из ЭтотОбъект Цикл
		
		Если СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ИнвалидВОВ
			И СтрокаСведенийВОВ.Период >= Дата(2020, 5, 1) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Категория ""Лицо с инвалидностью ВОВ (до мая 2020)"" используется до мая 2020 года'"), , , , Отказ);
			
		ИначеЕсли (СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныБоевыхДействийНаТерриторииДругихГосударств
			ИЛИ СтрокаСведенийВОВ.Статус = Перечисления.КатегорииФизлицУчастниковВОВ.ВетераныТруда)
			И СтрокаСведенийВОВ.Период < Дата(2020, 5, 1) Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Категории ""Ветераны боевых действий на территории других государств"", ""Ветераны труда"" используются с мая 2020 года'"), , , , Отказ);
						
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
